status_code = input("Введите код статуса (pending, processing, shipped, delivered, cancelled): ").lower()

match status_code:
    case "pending":
        status = "В ожидании"
        description = "Ваш заказ принят и ожидает обработки. Скоро мы начнем его собирать."
        emoji = "🕰️"
        time = "1-2 дня"
        recomendatsia = "-"

    case "processing":
        status = "В обработке"
        description = "Мы собираем ваш заказ и готовим его к отправке."
        emoji = "📦"
        time = "2-4 дня"
        recomendatsia = "-"

    case "shipped":
        status = "Отправлено"
        description = "Ваш заказ находится в пути к вам. Ожидайте уведомления о доставке."
        emoji = "✈️"
        time = "2-5 дня"
        recomendatsia = "Следите за уведомлениями о доставке."

    case "delivered":
        status = "Доставлено"
        description = "Заказ успешно вручен получателю. Благодарим за покупку!"
        emoji = "✔️"
        time = "Заказ выполнен"
        recomendatsia = "-"

    case "cancelled":
        status = "Отменено"
        description = "Заказ был отменен по вашему запросу или из-за недоступности товара."
        emoji = "❌"
        time = "-"
        recomendatsia = "-"

    case _:
        status = "Ошибка"
        description = "-"
        emoji = "❌"
        time = "-"
        recomendatsia = "-"

print("-----------------------------")
print(f"| Статус: {status} {emoji}")
print(f"| Описание: {description}")
print(f"| Примерное время ожидания: {time}")
print(f"| Рекомендация: {recomendatsia}")
print("-----------------------------")
